#lang racket
;Лабораторна робота 2
;ФІТ ПІ-41 Бочкарьов
;Вариант2. Знайти кількість одиниць в двійковому представленні числа n
;та значення глибини рекурсії, використовуючи рекурентне означення функції f(n)
;(& - операція побітового логічного множення):
;f(n)=1+f(n&(n-1))
;f(0)=0
(define (lab2fun n)
  (cond
    ((<= n 0)  0)
    ((> n 0)
     (+
      1
      (lab2fun
       ( bitwise-and 
         n
         (- n 1)
         )
      )
     )
   )
  )
)
(define (funct n) (
   (list 'Otvet: (lab2fun n) 'Rec:))
)
